//SHOWBUG3  JOB
//*
//*
//*-------------------------------------------------------------------
//*  demo the BUG with INSPECT CONVERTING
//*-------------------------------------------------------------------
//TESTIT    EXEC PGM=ICVRT03
//STEPLIB   DD DISP=SHR,DSN=Z08115.DINO.LOADLIB
//SYSPUNCH  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//*
//
